; domain
(define (domain mailfloor)
 (:requirements :strips :typing)
 (:types bay parcel carrier hand)
 (:predicates (stationed-at ?r - carrier ?x - bay)
         (posted ?o - parcel ?x - bay)
        (vacant ?r - carrier ?g - hand)
        (bearing ?r - carrier ?o - parcel ?g - hand))

   (:action walk
       :parameters  (?r - carrier ?from ?to - bay)
       :precondition (and  (stationed-at ?r ?from))
       :effect (and  (stationed-at ?r ?to)
         (not (stationed-at ?r ?from))))

   (:action collect
       :parameters (?r - carrier ?obj - parcel ?room - bay ?g - hand)
       :precondition  (and  (posted ?obj ?room) (stationed-at ?r ?room) (vacant ?r ?g))
       :effect (and (bearing ?r ?obj ?g)
        (not (posted ?obj ?room))
        (not (vacant ?r ?g))))

   (:action deposit
       :parameters (?r - carrier ?obj - parcel ?room - bay ?g - hand)
       :precondition  (and  (bearing ?r ?obj ?g) (stationed-at ?r ?room))
       :effect (and (posted ?obj ?room)
        (vacant ?r ?g)
        (not (bearing ?r ?obj ?g)))))

; problem
(define (problem mailfloor-p02)
(:domain mailfloor)
(:objects carrier1 - carrier
righthand1 lefthand1 - hand
bay1 bay2 bay3 bay4 - bay
parcel1 parcel2 - parcel)
(:init
(stationed-at carrier1 bay1)
(vacant carrier1 righthand1)
(vacant carrier1 lefthand1)
(posted parcel1 bay1)
(posted parcel2 bay4)
)
(:goal
(and
(posted parcel1 bay4)
(posted parcel2 bay3)
)
)
)

; plan
1. (walk carrier1 bay1 bay4)
   deleted: (stationed-at carrier1 bay1)
   added: (stationed-at carrier1 bay4)
   goals met: 0 of 2
2. (collect carrier1 parcel2 bay4 righthand1)
   deleted: (posted parcel2 bay4) (vacant carrier1 righthand1)
   added: (bearing carrier1 parcel2 righthand1)
   goals met: 0 of 2
3. (walk carrier1 bay4 bay1)
   deleted: (stationed-at carrier1 bay4)
   added: (stationed-at carrier1 bay1)
   goals met: 0 of 2
4. (collect carrier1 parcel1 bay1 lefthand1)
   deleted: (posted parcel1 bay1) (vacant carrier1 lefthand1)
   added: (bearing carrier1 parcel1 lefthand1)
   goals met: 0 of 2
5. (walk carrier1 bay1 bay3)
   deleted: (stationed-at carrier1 bay1)
   added: (stationed-at carrier1 bay3)
   goals met: 0 of 2
6. (deposit carrier1 parcel2 bay3 righthand1)
   deleted: (bearing carrier1 parcel2 righthand1)
   added: (posted parcel2 bay3) (vacant carrier1 righthand1)
   goals met: 1 of 2
7. (walk carrier1 bay3 bay4)
   deleted: (stationed-at carrier1 bay3)
   added: (stationed-at carrier1 bay4)
   goals met: 1 of 2
8. (deposit carrier1 parcel1 bay4 lefthand1)
   deleted: (bearing carrier1 parcel1 lefthand1)
   added: (posted parcel1 bay4) (vacant carrier1 lefthand1)
   goals met: 2 of 2
